In [100]:
import matplotlib.pyplot as plt
import pandas

ModuleNotFoundError: No module named 'matplotlib'

In [3]:
df=pandas.read_csv("../data-raw/07_gap-merged-with-continent.tsv",sep='\t')
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df.shape

(3313, 6)

In [6]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [7]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3313 entries, 0 to 3312
Data columns (total 6 columns):
country      3313 non-null object
continent    3313 non-null object
year         3313 non-null int64
lifeExp      3313 non-null float64
pop          3313 non-null int64
gdpPercap    3313 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 155.4+ KB

In [9]:
    country_df=df['country']
    country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [10]:
country_df.tail()

3308    Zimbabwe
3309    Zimbabwe
3310    Zimbabwe
3311    Zimbabwe
3312    Zimbabwe
Name: country, dtype: object

In [11]:
subset=df[['country','continent','year']]
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [12]:
subset.tail()

       country continent  year
3308  Zimbabwe    Africa  1987
3309  Zimbabwe    Africa  1992
3310  Zimbabwe    Africa  1997
3311  Zimbabwe    Africa  2002
3312  Zimbabwe    Africa  2007

In [13]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [21]:
number_of_row=df.shape[0]
last_row_index=number_of_row-1
df.iloc[last_row_index]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 3312, dtype: object

In [27]:
df.tail(n=10)

       country continent  year  lifeExp       pop   gdpPercap
3303  Zimbabwe    Africa  1962   52.358   4277736  527.272182
3304  Zimbabwe    Africa  1967   53.995   4995432  569.795071
3305  Zimbabwe    Africa  1972   55.635   5861135  799.362176
3306  Zimbabwe    Africa  1977   57.674   6642107  685.587682
3307  Zimbabwe    Africa  1982   60.363   7636524  788.855041
3308  Zimbabwe    Africa  1987   62.351   9216418  706.157306
3309  Zimbabwe    Africa  1992   60.377  10704340  693.420786
3310  Zimbabwe    Africa  1997   46.809  11404948  792.449960
3311  Zimbabwe    Africa  2002   39.989  11926563  672.038623
3312  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [29]:
type(df.head())

pandas.core.frame.DataFrame

In [33]:
type(df.loc[0])

pandas.core.series.Series

In [41]:
dftem=df.iloc[[1,2]]
type(dftem)

pandas.core.frame.DataFrame

In [46]:
df.loc[[1],["country"]]

       country
1  Afghanistan

In [51]:
subset.loc[:,['country','year']]

          country  year
0     Afghanistan  1952
1     Afghanistan  1957
2     Afghanistan  1962
3     Afghanistan  1967
4     Afghanistan  1972
...           ...   ...
3308     Zimbabwe  1987
3309     Zimbabwe  1992
3310     Zimbabwe  1997
3311     Zimbabwe  2002
3312     Zimbabwe  2007

[3313 rows x 2 columns]

In [54]:
subset.iloc[:,[0,1,2]]

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
3308     Zimbabwe    Africa  1987
3309     Zimbabwe    Africa  1992
3310     Zimbabwe    Africa  1997
3311     Zimbabwe    Africa  2002
3312     Zimbabwe    Africa  2007

[3313 rows x 3 columns]

In [65]:
small_range=list(range(0,6,3))
df.iloc[:,small_range]

          country  lifeExp
0     Afghanistan   28.801
1     Afghanistan   30.332
2     Afghanistan   31.997
3     Afghanistan   34.020
4     Afghanistan   36.088
...           ...      ...
3308     Zimbabwe   62.351
3309     Zimbabwe   60.377
3310     Zimbabwe   46.809
3311     Zimbabwe   39.989
3312     Zimbabwe   43.487

[3313 rows x 2 columns]

In [69]:
df.iloc[:,:3]

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
3308     Zimbabwe    Africa  1987
3309     Zimbabwe    Africa  1992
3310     Zimbabwe    Africa  1997
3311     Zimbabwe    Africa  2002
3312     Zimbabwe    Africa  2007

[3313 rows x 3 columns]

In [74]:
df.groupby('country')['year'].mean()

country
Afghanistan           1979.5
Albania               1979.5
Algeria               1979.5
Angola                1979.5
Argentina             1979.5
                       ...
Vietnam               1979.5
West Bank and Gaza    1979.5
Yemen, Rep.           1979.5
Zambia                1979.5
Zimbabwe              1979.5
Name: year, Length: 187, dtype: float64

In [85]:
grouped_year_df=df.groupby(['year','continent'])[['lifeExp','gdpPercap']].mean()
type(grouped_year_df)

pandas.core.frame.DataFrame

In [86]:
grouped_year_df.head()

                  lifeExp    gdpPercap
year continent
1950 Africa     41.361500  1422.081643
     Americas   59.405286  5567.245762
     Asia       53.675000  1363.645814
     Europe     65.755916  6804.996873
     FSU        59.950000  3638.203164

In [87]:
grouped_year_df.reset_index()

     year continent    lifeExp     gdpPercap
0    1950    Africa  41.361500   1422.081643
1    1950  Americas  59.405286   5567.245762
2    1950      Asia  53.675000   1363.645814
3    1950    Europe  65.755916   6804.996873
4    1950       FSU  59.950000   3638.203164
..    ...       ...        ...           ...
281  2007  Americas  73.400485  11940.901644
282  2007      Asia  70.660233  15338.057326
283  2007    Europe  77.299059  24174.152973
284  2007       FSU  69.457333   9522.539346
285  2007   Oceania  71.315000  13156.978742

[286 rows x 4 columns]

In [92]:
df.groupby('continent')['country'].nunique()

continent
Africa      53
Americas    36
Asia        43
Europe      35
FSU          9
Oceania     11
Name: country, dtype: int64

In [93]:
df.groupby('continent')['country'].value_counts()

continent  country
Africa     Libya                    13
           Uganda                   13
           Algeria                  12
           Angola                   12
           Benin                    12
                                    ..
Oceania    Solomon Islands           9
           Micronesia, Fed. Sts.     8
           Samoa                     7
           Tonga                     7
           Vanuatu                   7
Name: country, Length: 187, dtype: int64

In [95]:
grouped_year_df().head()

TypeError: 'DataFrame' object is not callable

In [97]:
grouped_year_df.plot()

ModuleNotFoundError: No module named 'matplotlib'